# Pandas for Data Analysis: Chapter 4, Pandas

## The main pandas data structures are *Series* and *DataFrame*, these two are explored below.

### pandas: *Series*

A *series* is a one-dimensional array-like object that contains essentially two arrays: an index array (indexer), and a values array. In my eyes this is easily thought of as a dictionary, and one can initialize a series with a dictionary

In [2]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [3]:
obj = Series([4,7,5,-3])

In [4]:
obj

0    4
1    7
2    5
3   -3
dtype: int64

Notice that the indexer is created by default, as a mapping from the naturals to the values passed into the Series() constructor. Hence, we see the default indexer is [0,1,2,...,N-1] if the len(value_array) = N

In [5]:
obj.values # obj.index

array([ 4,  7,  5, -3])

We may also pass in our own indexer as well, as the following shows:

In [6]:
obj = Series([4,7,5,-3], index=['d','b','a','c'])

In [7]:
obj

d    4
b    7
a    5
c   -3
dtype: int64

In [8]:
obj.index

Index(['d', 'b', 'a', 'c'], dtype='object')

We may use values in the indexer to index and slice the series object

In [9]:
obj['a']

5

In [10]:
obj[['d','a']]

d    4
a    5
dtype: int64

In [11]:
type(obj[['d','a']])

pandas.core.series.Series

All operations we saw on NumPy arrays still hold, such as boolean indexing, scalar multiplication, etc.

In [12]:
obj[obj > 0]

d    4
b    7
a    5
dtype: int64

In [13]:
obj*2

d     8
b    14
a    10
c    -6
dtype: int64

In [14]:
np.exp(obj)

d      54.598150
b    1096.633158
a     148.413159
c       0.049787
dtype: float64

In [15]:
'b' in obj

True

In [16]:
'z' in obj

False

As mentioned, may initialize Series object with python dictionary

In [17]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [18]:
obj2 = Series(sdata)

In [19]:
obj2

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [20]:
obj2.index

Index(['Ohio', 'Oregon', 'Texas', 'Utah'], dtype='object')

**Note:** that when initialized with a dictionary, the indexer will be put into sorted order immediately

In [21]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [22]:
obj4 = Series(sdata, index=states)

In [23]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

The data for three of the indexes were found within the sdata dictionary. When there is an index value that doesn't have associated data when initialized, it will immediately become NaN (Not a Number). A common way to detect missing data is through the **isnull** and **notnull** methods

In [24]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [25]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

**Note:** *Series* objects are capable of discerning the indexes when 'concatenating' two different series objects. Any missing data will be filled as *NaN*

In [26]:
# Recall obj2, obj4
obj2

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [27]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [28]:
# Notice these have different indexer (although some may be overlapping), watch what happens when we concatenate
obj3 = obj2 + obj4

In [29]:
obj3

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [30]:
obj3.name = 'population' # an attribute to the Series object itself -- see in summary

In [31]:
obj3.index.name = 'state'

In [32]:
obj3

state
California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
Name: population, dtype: float64

In [33]:
# Series Indexer can be altered by inplace assignment
obj3.index = ['Bob','Joe','Will','Jazz','Jordan']

In [34]:
obj3

Bob            NaN
Joe        70000.0
Will       32000.0
Jazz      142000.0
Jordan         NaN
Name: population, dtype: float64

### pandas: DataFrame

This is very similar to an R dataframe. The *DataFrame* object is best used for spreadsheet-style, database-like storage of information. I.e., it is useful for heterogeneous, tabular data.

In [35]:
# Many ways to construct a DataFrame, but the typical way is through dictionary
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [36]:
frame # Note: The indexer is automatically assigned

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

**Note:** Each colum with the associated index is like a *Series* object. Hence, a *DataFrame* object is nothing more than multiple *Series* objects. Keeping this in the back of your head will help understand the nuances of the *DataFrame*

In [37]:
# You may specify in what order you'd like to see your columns as well
DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [38]:
# Similar to Series, if you pass something without data it will populate as NaN
frame = DataFrame(data, columns=['year','state','pop','debt'], index=['one','two','three','four','five'])

In [39]:
frame.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [40]:
type(frame['state']) # This is proof that columns are actually Series objects

pandas.core.series.Series

In [41]:
frame['state'] # dict notation

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [42]:
frame.state # member data notation, notice that the name attribute is appropriately set

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [43]:
frame.loc['three'] # Frames can also be indexed from position/name, retrieves a row

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [44]:
frame['debt'] = np.arange(5.)

In [45]:
frame

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

**Note:** When assigning arrays / lists to a column, the values length must match that of the dataframe

In [46]:
# What about inserting a Series object?
val = Series([-1.2,-1.5,-1.7], index=['one', 'three', 'six'])

In [47]:
frame['debt'] = val

In [48]:
frame # Notice that the index 'six' isn't even considered since it doesn't exist in the previous dataframe

       year   state  pop  debt
one    2000    Ohio  1.5  -1.2
two    2001    Ohio  1.7   NaN
three  2002    Ohio  3.6  -1.5
four   2001  Nevada  2.4   NaN
five   2002  Nevada  2.9   NaN

To create a new column, simply assign a non-existing column. If you'd like to delete a column, use the familiar del command as in a dictionary key

In [49]:
frame['eastern'] = frame.state == "Ohio"

In [50]:
frame

       year   state  pop  debt  eastern
one    2000    Ohio  1.5  -1.2     True
two    2001    Ohio  1.7   NaN     True
three  2002    Ohio  3.6  -1.5     True
four   2001  Nevada  2.4   NaN    False
five   2002  Nevada  2.9   NaN    False

In [51]:
del frame['eastern']

**Note:** Another common form of data is nested dictionaries. See below for an example of how pandas interprets this data

In [52]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [53]:
frame3 = DataFrame(pop)

In [54]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

**Note:** The second-layer of keys become the indexes

In [55]:
# If needed, we can just transpose the result
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

**Note:** The keys are sorted/unioned when passing in through a dictionary (notice in the 2000 row there is no data for Nevada. However, if you pass in the index explicitly this will not be done. (Similar with dictionaries of series) See below.

In [56]:
DataFrame(pop, index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [57]:
frame3.index.name = "year"; frame3.columns.name = "state"

In [58]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [59]:
frame3.values # To just obtain the data

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [60]:
frame3['temp'] = ['Hello','World','Your'] #dtype will be chosen to accomodate all columns

In [61]:
frame3.values

array([[nan, 1.5, 'Hello'],
       [2.4, 1.7, 'World'],
       [2.9, 3.6, 'Your']], dtype=object)

In [62]:
type(frame3.values)

numpy.ndarray

**Note:** Index objects are immutable, and there exist different index types for different purposes. For example, *Int64Index* for integer values, *MultiIndex* for hierarchical data, *DateTimeIndex* stores nanosecond date stamps (good for financial data surely), *PeriodIndex* for Period data (timespans)

**Note:** Suppose you have two DataFrames with index1 and index2 as their indexers respectively. Suppose you'd like to take unions/intersections/set_differences, all of these logical things, based on the indexers. This is made quite simple in pandas, for all of these methods on index classes are already created.

## Essential Functionality in pandas

### ReIndexing

Reindex() is a method that will create a new object with the data *conformed* to a new index

In [63]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [64]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [65]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [66]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [67]:
obj2 = obj.reindex(['a','b','c','d','e'], fill_value=0) # Default method for filling in NaN

In [68]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

*reindex* can alter either the (row) index, columns, or both. When passed as a sequence, the rows are reindexed as a result

In [69]:
df = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])

In [70]:
df

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [71]:
df2 = df.reindex(['a','b','c','d'])

In [72]:
df2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [73]:
# Columns reindexed with key-word columns
states = ['Texas','Utah','California']
df.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [74]:
df.loc[['a','b','c','d'], states] # Do both at one time

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

### Dropping entries from an axis

One may remove/drop entries very easily through the drop method, as illustrated below.

In [75]:
obj = Series(np.arange(5.),index=['a','b','c','d','e'])

In [76]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [77]:
new_obj = obj.drop('c')

In [78]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [79]:
obj.drop(['c','d'])

a    0.0
b    1.0
e    4.0
dtype: float64

Now for a *DataFrame*

In [80]:
data = DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [81]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [82]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [83]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

### Indexing, Selection, and Filtering

*Series* indexing (obj[...]) works similarly to NumPy indexing, except instead of just integer, positional indexes you may use the Indexer to select the desired data

In [84]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [85]:
obj['b']

1.0

In [86]:
obj[1]

1.0

In [87]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [88]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [89]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [90]:
obj[obj>1]

c    2.0
d    3.0
dtype: float64

**Note:** Slicing with Labels is **endpoint inclusive** unlike typical python data structures

In [91]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [92]:
obj['b':'c'] = 17.6 # Setting particular indexes to a value is just the same

In [93]:
obj

a     0.0
b    17.6
c    17.6
d     3.0
dtype: float64

In [94]:
# Note: Below, we are indexing by column!
data = DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [95]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [96]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [97]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

**Note:** Selecting rows by slicing, boolean array/ boolean dataframe, as seen below.

In [98]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [99]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [100]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [101]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [102]:
data[data < 5] = 0

In [103]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

**Note:** A recommended way to slice-and-dice is to use the .loc() method (since the .ix is depreciated)

In [104]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int64

In [105]:
data.ix[['Colorado','Utah'], [3,0,1]]

/usr/local/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [106]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [107]:
data.ix[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [108]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

**Recap: How to select data from pandas *DataFrame*** <br>
obj[val] = select single column/sequence of columns from Df. Special case: Boolean array, slice, boolean df <br>
obj.ix[val] = select single row of subset of rows from the Df <br>
obj.ix[:, val] = select single column of subset of columns <br>
obj.ix[val1,val2] = select both rows and columns <br>
icol, irow method = select single row or column as a Series by integer location <br>
get_value, set_value = select single value by row and column label <br>
xs method = select single row or column by Series Label <br>

### Arithmetic and Data Alignment

Important feature of pandas is behavior of arithmetic between objects with different indexers. For example, when adding together two objects (concatentating), if an index pair is not the same, the index will result in the union of index pairs. See below.

In [109]:
# Series Example
s1 = Series([7.3,-2.5,3.4,1.5], index=['a','c','d','e'])

In [110]:
s2 = Series([-2.1,3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [111]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [112]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [113]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [114]:
# DataFrame example
df1 = DataFrame(np.arange(9.).reshape((3,3,)), columns=list('bcd'),index=['Ohio','Texas','Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4,3,)), columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

In [115]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [116]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [117]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [118]:
# We may want to control these NaN's by filling them, here's how
df1 = DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))

In [119]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [120]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [121]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [122]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [123]:
df1.reindex(columns=df2.columns,fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### Operations between Series and DataFrames

In [124]:
arr = np.arange(12.).reshape((3,4))

In [125]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [126]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [127]:
arr - arr[0] # Somehow, this is referred to as broadcasting

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [128]:
frame = DataFrame(np.arange(12.).reshape((4,3)), columns = list('bde'),
                  index = ['Utah','Ohio','Texas','Oregon'])

In [129]:
series = frame.ix[0]

/usr/local/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [130]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [131]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [132]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [133]:
series = frame.ix[1]

In [134]:
frame - series

          b    d    e
Utah   -3.0 -3.0 -3.0
Ohio    0.0  0.0  0.0
Texas   3.0  3.0  3.0
Oregon  6.0  6.0  6.0

**Observation:** It seems that the row / column on which you obtain the series, once you perform arithmetic will boradcast to the other rows / columsn respectively. In the examples above, we first defined the frame and got the first row (zero element) of the data. Once we subtracted this first row from the frame itself, each of the subsequent rows took their zeroeth element and broadcasted that to all columns throughout the row

In [135]:
series2 = Series(range(3), index=['b','e','f'])

In [136]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [137]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [138]:
series2

b    0
e    1
f    2
dtype: int64

### Function application and mapping

In [139]:
# NumPy universal, element-wise functions work just the same w/ pandas objects. 
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [140]:
frame

               b         d         e
Utah   -0.606418 -0.062268 -0.045301
Ohio   -1.326129 -1.826710 -0.119135
Texas  -1.617097 -0.481582  1.477773
Oregon -0.544688  1.150418 -0.709448

In [141]:
np.abs(frame)

               b         d         e
Utah    0.606418  0.062268  0.045301
Ohio    1.326129  1.826710  0.119135
Texas   1.617097  0.481582  1.477773
Oregon  0.544688  1.150418  0.709448

It is common that we will need to apply a function to each row, or column, of our dataframe. That is, the arugment to our function should be of type 1D array.

In [142]:
f = lambda x: x.max() - x.min()

In [143]:
frame.apply(f)

b    1.072409
d    2.977128
e    2.187221
dtype: float64

In [144]:
frame.apply(f, axis=1)

Utah      0.561117
Ohio      1.707574
Texas     3.094871
Oregon    1.859865
dtype: float64

In [145]:
frame

               b         d         e
Utah   -0.606418 -0.062268 -0.045301
Ohio   -1.326129 -1.826710 -0.119135
Texas  -1.617097 -0.481582  1.477773
Oregon -0.544688  1.150418 -0.709448

In [146]:
np.abs(frame).apply(f,axis=1)

Utah      0.561117
Ohio      1.707574
Texas     1.135516
Oregon    0.605730
dtype: float64

In [147]:
# Using apply with a function that returns a series as well, not just a scalar
def f(x):
    return Series([x.min(), x.max()], index=['min','max'])

In [148]:
frame.apply(f)

            b         d         e
min -1.617097 -1.826710 -0.709448
max -0.544688  1.150418  1.477773

In [149]:
# Element-wise functions can be used too. Suppose you want to format a string from each float in a df. use applymap
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah    -0.61  -0.06  -0.05
Ohio    -1.33  -1.83  -0.12
Texas   -1.62  -0.48   1.48
Oregon  -0.54   1.15  -0.71

In [150]:
# The term 'applymap' comes from the fact that it is element wise. 
# Here is what is happening under the hood, but it does this for all columns 
frame['e'].map(format)

Utah      -0.05
Ohio      -0.12
Texas      1.48
Oregon    -0.71
Name: e, dtype: object

### Sorting and Ranking

Sorting data based on some criterion is often important. One commonly needs to perform a lexicographical sort, this can be done by sort_index() method which returns a new sorted object.

In [151]:
obj = Series(range(4), index=['d','a','b','c'])

In [152]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [153]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

With a *DataFrame*, we may sort by index on either axis

In [154]:
frame = DataFrame(np.arange(8.).reshape((2,4)),index=['three','one'],columns=['d','a','b','c'])

In [155]:
frame.sort_index()

         d    a    b    c
one    4.0  5.0  6.0  7.0
three  0.0  1.0  2.0  3.0

In [156]:
frame.sort_index(1)

         a    b    c    d
three  1.0  2.0  3.0  0.0
one    5.0  6.0  7.0  4.0

To sort a *Series* by its values, use the **order()** method

In [157]:
obj = Series([4,7,-3,2])

In [158]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [159]:
# Missing values are sorted to the end of Series by default
obj = Series([4, np.nan, 7, np.nan, -3, 2])

In [160]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In a *DataFrame*, one may want to sort by value for multiple columns. Pass these columns in with the **by** option

In [161]:
frame = DataFrame({'b': [4,7,-3,2], 'a': [0,1,0,1]})

In [162]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [163]:
frame.sort_values(by='b', ascending=False)

   a  b
1  1  7
0  0  4
3  1  2
2  0 -3

In [164]:
frame.sort_values(by=['a','b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [165]:
# Ranking is similar to sorting, except there is a rule for ties
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [166]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [167]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [168]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [169]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})

In [170]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [171]:
frame.rank(axis=1, method='max')

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

## Axis indices with duplicate values

Consider the following series with duplicate values,

In [172]:
obj = Series(range(5),index=['a','a','b','b','c'])

In [173]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [174]:
obj.index.is_unique

False

In [175]:
obj['a']

a    0
a    1
dtype: int64

In [176]:
obj.a

a    0
a    1
dtype: int64

In [177]:
df = DataFrame(np.random.randn(4,3), index=['a','a','b','b'])

In [178]:
df

          0         1         2
a  0.217617  0.957041 -1.168077
a  0.604007  1.143446  1.407974
b  0.620596  0.069064  0.280773
b  0.006917 -0.498932 -1.098529

In [179]:
df.loc['b']

          0         1         2
b  0.620596  0.069064  0.280773
b  0.006917 -0.498932 -1.098529

### Summarizing and Computing Descriptive Statistics

Many built in methods to compute/summarize statistics, many of which are built of the underlying numpy ndarray. Here we will see the use of different statistical methods on Series and DataFrames

In [180]:
df = DataFrame([[1.4,np.nan], [7.1,-4.5], [np.nan, np.nan], [0.75, -1.3]], 
              index = ['a','b','c','d'], 
               columns = ['one','two'])

In [181]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

To obtain a Series that contains the sum of each column, use the **.sum()** method

In [183]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [184]:
type(df.sum())

pandas.core.series.Series

To sum over rows, simply pass 1 to the **axis** argument

In [185]:
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

By default, the NaN values are skipped over. Pass False to the **skipna** argument

In [186]:
df.sum(axis=1, skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

Note that the .level method is used to reduce group by level in the case of MultiIndex datatype (hiearchically-indexed).

To identify the index at which a max/min occurs over a given Series, use the methods **idxmax, idxmin**

In [187]:
df.idxmax()

one    b
two    d
dtype: object

Other methods are *accumulations*, in that they accumulate over a given axis

In [189]:
# .cumsum() is a method of an accumulator, it returns the cumulative sum over a Series
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

Some methods are neither reduction nor accumulator. For example, the **describe** method produces a basic set of summary statistics immediately.

In [190]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

On non numeric data, **describe** provides an equally valuable, alternate set of statistics

In [191]:
obj = Series(['a','a','b','c'] * 4)

In [192]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

Here is a non-exhaustive collection of statistical methods used frequently on pandas dataframes: <br>
**count:** Number of non-NA values <br>
**describe:** Compute set of summary statistics over each DataFrame column <br>
**min, max:** Compute maximum and minimum values <br>
**argmin, argmax:** Compute index (integers only) location of min / max <br>
**idxmin, idxmax:** Compute index (any type) location of min/max <br>
**quantile:** Compute sample quantile $\in [0,1]$ <br>
**sum:** Sum of values <br>
**mean:** Mean of values <br>
**median:** Arithmetic median (50% quantile) of values <br>
**mad:** Mean absolute deviation from mean value <br>
**var:** Sample variance of values <br>
**std:** Sample stdev of values <br>
**skew:** Sample skewness of values <br>
**kurt:** Sample kurtosis of value <br>
**cumsum:** Cumulative sum of values <br>
**cummin, cummax:** Cumulative minimum or maximum of values <br>
**cumprod:** Cumulative product of values <br>
**diff:** Compute first arithmistic difference <br>
**pct_change** Compute percent changes

### Correlation and Covariance

Often times we are looking at a pair of entries in order to generate a sample statistic. Consider the following *Dataframe* of stock prices and values obtained from Yahoo! Finance:

In [217]:
import pandas_datareader.data as web
import datetime    

start = datetime.datetime(2000, 1, 1)
end = datetime.datetime(2010, 1, 1)

all_data = {}
for ticker in ['AAPL','GOOGL', 'IBM', 'MSFT']:
    all_data[ticker] = web.DataReader(ticker, 'yahoo', start, end)
    
price = DataFrame({tic: data['Adj Close']
                  for tic, data in all_data.iteritems()})

volume = DataFrame({tic: data['Volume']
                  for tic, data in all_data.iteritems()})

/usr/local/lib/python3.6/site-packages/pandas_datareader/base.py:186: DeprecationWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  df = self._dl_mult_symbols(self.symbols)
/usr/local/lib/python3.6/site-packages/pandas_datareader/yahoo/daily.py:148: DeprecationWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  return Panel(stocks).swapaxes('items', 'minor')
/usr/local/lib/python3.6/site-packages/pandas/core/generic.py:2533: DeprecationWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  copy=copy, allow_dups=False)

AttributeError: 'Panel' object has no attribute 'index'